__author__ = 'Байнетов Д.С.'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

number = input("Введите целое число:")

i=0
while i< len(number):
    print(number[i])
    i+=1

print("Реешение через for")
for i in range(len(number)):
    print(number[i])

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a=input("Введите переменную а: ")
b=input("Введите переменную b: ")

print(f"Исходные значения: a={a}, b={b}")
c=a
a=b
b=c
print(f"Меняем значения местами: a={a}, b={b}")

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age=int(input("Укажите вваш возраст: "))
if (age>=18):
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")